Revit 2026 API

# IntersectionResultParameter Property

---

1d parameter of the point of intersection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Parameter { get; }
```
```vb
Public ReadOnly Property Parameter As Double
	Get
```
```cpp
public:
property double Parameter {
	double get ();
}
```
```fsharp
member Parameter : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

#### Reference

IntersectionResult Class

Autodesk.Revit.DB Namespace